OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/0/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

frontAndBack
{
    type empty;
}

// ************************************************************************* //
