OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        /*type            calculated;
        value           uniform 0;*/
	type empty;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.1;
        value           uniform 0.0;
    }

    Envelope_1
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.1;
        value           uniform 0.0;
    }

    upperWall
    {
        type            calculated;
        value           uniform 0;
    }


}

// ************************************************************************* //
